IRP/src/InformationRegisters/IntegrationInfo/IntegrationInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>IntegrationInfo</name>
  <resources>
    <name>Value</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>SecondValue</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <types>Date</types>
      <types>Boolean</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/IntegrationType/IntegrationType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>IntegrationType</name>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>CurrencyRates</name>
  </enumValues>
  <enumValues>
    <name>FileStorage</name>
  </enumValues>
  <enumValues>
    <name>ScriptStorage</name>
  </enumValues>
  <enumValues>
    <name>LocalFileStorage</name>
  </enumValues>
  <enumValues>
    <name>GoogleDrive</name>
  </enumValues>
</mdclass:Enum>

IRP/src/CommonModules/IntegrationServerReuse/Module.bsl
Function ConnectionSetting(IntegrationSettingName, AddInfo = Undefined) Export
	Result = New Structure("Success, Value, Message", False, Undefined, "");
	
	IntegrationSettingsRef = UniqueID.UniqueIDByName(Metadata.Catalogs.IntegrationSettings, IntegrationSettingName);
	
	If Not ValueIsFilled(IntegrationSettingsRef) Then
		Result.Success = False;
		Result.Message = StrTemplate(R()["S_005"], IntegrationSettingName);
		Return Result;
	EndIf;
	
	ConnectionSetting = ConnectionSettingTemplate(IntegrationSettingsRef.IntegrationType, AddInfo);
	
	// Customize setting with according IntegrationSettings catalog
	CustomizedSetting = New Structure();
	For Each Str In IntegrationSettingsRef.ConnectionSetting Do
		If ValueIsFilled(Str.Value) Then
			CustomizedSetting.Insert(Str.Key, Str.Value);
		EndIf;
	EndDo;
	FillPropertyValues(ConnectionSetting, CustomizedSetting);
	
	ConnectionSetting.Insert("IntegrationSettingsRef", IntegrationSettingsRef);
	ConnectionSetting.Insert("IntegrationType", IntegrationSettingsRef.IntegrationType);
	Result.Success = True;
	Result.Value = ConnectionSetting;
	Return Result;
EndFunction

Function ConnectionSettingTemplate(IntegrationType = Undefined, AddInfo = Undefined) Export
	ConnectionSetting = New Structure();
	If IntegrationType = Enums.IntegrationType.LocalFileStorage Then
		ConnectionSetting.Insert("AddressPath", "");
	Else
		ConnectionSetting.Insert("QueryType", "POST");
		ConnectionSetting.Insert("ResourceAddress", "");
		ConnectionSetting.Insert("Ip", "localhost");
		ConnectionSetting.Insert("Port", 8080);
		ConnectionSetting.Insert("User", "");
		ConnectionSetting.Insert("Password", "");
		ConnectionSetting.Insert("Proxy", Undefined);
		ConnectionSetting.Insert("TimeOut", 60);
		ConnectionSetting.Insert("SecureConnection", Undefined);
		ConnectionSetting.Insert("UseOSAuthentication", False);
		ConnectionSetting.Insert("Headers", New Map());
	EndIf;
	Return ConnectionSetting;
EndFunction

Function InfoRegSettingsStructure() Export
	Query = New Query;
	Query.Text =
		"SELECT TOP 1
		|	*
		|FROM
		|	InformationRegister.IntegrationInfo AS IntegrationInfo
		|WHERE
		|	FALSE";
	
	Return Query.Execute().Unload();
	
EndFunction
